app/controllers/api/v1/blogs_controller.rb

  def index
    if params[:per] === 'all'
      @blogs = Blog.all
      render json: {status: 'SUCCESS', message: 'Loaded all blogs', code: 200, data: @blogs, pagination: {total_entries: "All" }}, status: :ok
    elsif
      @blogs = Blog.page(params[:page] || 1).per(params[:per_page] || 5)
---
SELECT "blogs".* FROM "blogs" LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "blogs"