app/controllers/api/v1/categories_controller.rb

SELECT "categories".* FROM "categories" LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "categories"
---
  def index
    if params[:per] === 'all'
      @categories = Category.all
      render json: {status: 'SUCCESS', message: 'Loaded all categories', code: 200, data: @categories, pagination: {total_entries: "All" }}, status: :ok
    elsif
      @categories = Category.page(params[:page] || 1).per(params[:per_page] || 5)