app/controllers/api/v1/teams_controller.rb

  def index
    if params[:per] === 'all'
      @teams = Team.all
      render json: {status: 'SUCCESS', message: 'Loaded all teams', code: 200, data: @teams, pagination: {total_entries: "All" }}, status: :ok
    elsif
      @teams = Team.page(params[:page] || 1).per(params[:per_page] || 5)
---
SELECT "teams".* FROM "teams" LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "teams"